UAir.CityId = {
    "京津冀": "01",
    "长三角": "02",
    "珠三角": "03",
    "成渝": "04",
    "福建省": "05",
    "北京": "001",
    "上海": "002",
    "天津": "006",
    "重庆": "007",
    "七台河市": "088",
    "三明市": "294",
    "三门峡市": "233",
    "上海市": "002",
    "上饶市": "298",
    "东莞市": "025",
    "东营市": "160",
    "中卫市": "216",
    "中山市": "041",
    "临夏": "208",
    "临汾市": "133",
    "临沂市": "157",
    "临沧市": "360",
    "丹东市": "106",
    "丽水市": "267",
    "丽江市": "363",
    "乌兰察布": "118",
    "乌海市": "117",
    "乌鲁木齐": "166",
    "乐山市": "342",
    "九江市": "297",
    "云浮市": "038",
    "亳州市": "279",
    "伊春市": "086",
    "伊犁": "175",
    "佛山市": "026",
    "佳木斯市": "082",
    "保定市": "017",
    "保山市": "354",
    "信阳市": "222",
    "克拉玛依市": "167",
    "六安市": "285",
    "六盘水市": "328",
    "兰州市": "198",
    "兴安盟": "125",
    "内江市": "340",
    "凉山": "344",
    "包头市": "116",
    "北京市": "001",
    "北海市": "378",
    "十堰市": "254",
    "南京市": "050",
    "南充市": "333",
    "南宁市": "366",
    "南平市": "295",
    "南昌市": "296",
    "南通市": "236",
    "南阳市": "223",
    "厦门市": "288",
    "双鸭山市": "091",
    "台州市": "265",
    "合肥市": "271",
    "吉安市": "301",
    "吉林市": "093",
    "吐鲁番": "170",
    "吕梁市": "137",
    "吴忠市": "214",
    "周口市": "230",
    "呼伦贝尔": "124",
    "呼和浩特": "115",
    "和田地区": "178",
    "咸阳市": "139",
    "哈密地区": "177",
    "哈尔滨市": "079",
    "唐山市": "013",
    "商丘市": "226",
    "商洛市": "143",
    "喀什地区": "174",
    "嘉兴市": "263",
    "嘉峪关市": "211",
    "四平市": "095",
    "固原市": "215",
    "塔城地区": "176",
    "大兴安岭": "085",
    "大同市": "128",
    "大庆市": "087",
    "大理": "351",
    "大连市": "102",
    "天水市": "206",
    "天津市": "006",
    "太原市": "127",
    "威海市": "161",
    "娄底市": "314",
    "孝感市": "247",
    "宁德市": "289",
    "宁波市": "005",
    "安庆市": "276",
    "安康市": "144",
    "安阳市": "218",
    "安顺市": "323",
    "定西市": "199",
    "宜宾市": "339",
    "宜昌市": "252",
    "宜春市": "300",
    "宝鸡市": "146",
    "宣城市": "284",
    "宿州市": "277",
    "宿迁市": "244",
    "山南地区": "184",
    "岳阳市": "316",
    "崇左市": "367",
    "巴中市": "337",
    "巴彦淖尔": "122",
    "常州市": "242",
    "常德市": "312",
    "平凉市": "200",
    "平顶山市": "221",
    "广元市": "349",
    "广安市": "336",
    "广州市": "009",
    "庆阳市": "201",
    "廊坊市": "022",
    "延安市": "140",
    "延边": "094",
    "开封市": "224",
    "张家口市": "019",
    "张家界市": "317",
    "张掖市": "204",
    "徐州市": "239",
    "德宏": "364",
    "德州市": "152",
    "德阳市": "348",
    "忻州市": "136",
    "怀化市": "318",
    "恩施": "253",
    "惠州市": "028",
    "成都市": "008",
    "扬州市": "237",
    "承德市": "020",
    "抚州市": "299",
    "抚顺市": "104",
    "拉萨市": "182",
    "揭阳市": "030",
    "攀枝花市": "330",
    "文山": "355",
    "新乡市": "219",
    "新余市": "305",
    "无锡市": "078",
    "日喀则": "183",
    "日照市": "163",
    "昆明市": "350",
    "昌吉": "169",
    "昌都地区": "186",
    "昭通市": "359",
    "晋中市": "130",
    "晋城市": "132",
    "普洱市": "358",
    "景德镇市": "303",
    "曲靖市": "353",
    "朔州市": "135",
    "朝阳市": "112",
    "本溪市": "105",
    "来宾市": "369",
    "杭州市": "261",
    "松原市": "099",
    "林芝地区": "185",
    "果洛": "193",
    "枣庄市": "162",
    "柳州市": "368",
    "株洲市": "309",
    "梅州市": "032",
    "梧州市": "371",
    "楚雄": "357",
    "榆林市": "141",
    "武威市": "202",
    "武汉市": "003",
    "毕节市": "327",
    "永州市": "319",
    "汉中市": "145",
    "汕头市": "034",
    "汕尾市": "035",
    "江门市": "029",
    "池州市": "286",
    "沈阳市": "101",
    "沧州市": "021",
    "河池市": "377",
    "河源市": "027",
    "泉州市": "291",
    "泰安市": "156",
    "泰州市": "243",
    "泸州市": "338",
    "洛阳市": "225",
    "济南市": "149",
    "济宁市": "155",
    "海东": "190",
    "海北": "196",
    "海南": "192",
    "海口市": "384",
    "海西": "195",
    "淄博市": "151",
    "淮北市": "282",
    "淮南市": "274",
    "淮安市": "240",
    "深圳市": "004",
    "清远市": "033",
    "温州市": "266",
    "渭南市": "142",
    "湘潭市": "308",
    "湘西": "320",
    "湛江市": "039",
    "滁州市": "281",
    "滨州市": "159",
    "漯河市": "231",
    "漳州市": "292",
    "潍坊市": "154",
    "潜江市": "260",
    "潮州市": "024",
    "澳门": "380",
    "濮阳市": "229",
    "烟台市": "153",
    "焦作市": "227",
    "牡丹江市": "081",
    "玉林市": "374",
    "玉树": "194",
    "玉溪市": "356",
    "珠海市": "042",
    "甘南": "209",
    "甘孜": "346",
    "白城市": "097",
    "白山市": "100",
    "白银市": "210",
    "百色市": "375",
    "益阳市": "313",
    "盐城市": "238",
    "盘锦市": "113",
    "眉山市": "343",
    "石嘴山市": "213",
    "石家庄市": "011",
    "福州市": "287",
    "秦皇岛市": "014",
    "红河": "352",
    "绍兴市": "264",
    "绥化市": "083",
    "绵阳市": "332",
    "聊城市": "165",
    "肇庆市": "040",
    "自贡市": "331",
    "舟山市": "270",
    "芜湖市": "273",
    "苏州市": "073",
    "茂名市": "031",
    "荆州市": "251",
    "荆门市": "257",
    "莆田市": "290",
    "莱芜市": "164",
    "菏泽市": "158",
    "萍乡市": "304",
    "营口市": "108",
    "葫芦岛市": "114",
    "蚌埠市": "272",
    "衡水市": "023",
    "衡阳市": "310",
    "衢州市": "269",
    "西双版纳": "365",
    "西宁市": "189",
    "西安市": "138",
    "许昌市": "220",
    "贵港市": "373",
    "贵阳市": "321",
    "贺州市": "372",
    "资阳市": "341",
    "赣州市": "302",
    "赤峰市": "120",
    "辽源市": "098",
    "辽阳市": "110",
    "达州市": "334",
    "运城市": "134",
    "连云港市": "241",
    "通化市": "096",
    "通辽市": "119",
    "遂宁市": "335",
    "遵义市": "322",
    "邢台市": "016",
    "那曲地区": "187",
    "邯郸市": "015",
    "郑州市": "217",
    "郴州市": "311",
    "鄂尔多斯市": "121",
    "鄂州市": "246",
    "酒泉市": "205",
    "重庆市": "007",
    "金华市": "268",
    "金昌市": "203",
    "钦州市": "376",
    "铁岭市": "111",
    "铜仁市": "326",
    "铜川市": "147",
    "铜陵市": "283",
    "银川市": "212",
    "锡林郭勒": "123",
    "锦州市": "107",
    "镇江市": "235",
    "长春市": "092",
    "长沙市": "307",
    "长治市": "131",
    "阜新市": "109",
    "阜阳市": "278",
    "防城港市": "379",
    "阳江市": "037",
    "阳泉市": "129",
    "阿克苏": "173",
    "阿勒泰": "179",
    "阿坝": "347",
    "阿拉善盟": "126",
    "阿里地区": "188",
    "陇南市": "207",
    "随州市": "256",
    "雅安市": "345",
    "青岛市": "150",
    "鞍山市": "103",
    "韶关市": "036",
    "香港": "010",
    "马鞍山市": "275",
    "驻马店市": "232",
    "鸡西市": "089",
    "鹤壁市": "228",
    "鹤岗市": "090",
    "鹰潭市": "306",
    "黄冈市": "248",
    "黄南": "191",
    "黄山市": "280",
    "黄石市": "249",
    "黑河市": "084",
    "黔西南": "329",
    "齐齐哈尔": "080",
    "龙岩市": "293",
    "咸宁市": "250",
    "怒江": "361",
    "桂林市": "370",
    "湖州市": "262",
    "迪庆": "362",
    "邵阳市": "315",
    "黔东南": "325",
    "黔南": "324"
};
UAir.CityNamePair = {
    JingJinJi: "京津冀",
    ChangSanJiao: "长三角",
    ZhuSanJiao: "珠三角",
    ChengYu: "成渝",
    Beijing: "北京",
    Shanghai: "上海",
    Tianjin: "天津",
    Chongqing: "重庆",
    "Hong Kong": "香港",
    qitaihe: "七台河市",
    sanya: "三亚市",
    sanming: "三明市",
    sanmenxia: "三门峡市",
    Shanghai: "上海市",
    shangrao: "上饶市",
    Dongguan: "东莞市",
    dongying: "东营市",
    zhongwei: "中卫市",
    Zhongshan: "中山市",
    linxia: "临夏",
    linfen: "临汾市",
    linyi: "临沂市",
    lincang: "临沧市",
    dandong: "丹东市",
    lishui: "丽水市",
    lijiang: "丽江市",
    wulanchabu: "乌兰察布",
    wuhai: "乌海市",
    wulumuqi: "乌鲁木齐",
    leshan: "乐山市",
    jiujiang: "九江市",
    Yunfu: "云浮市",
    bozhou: "亳州市",
    yichun: "伊春市",
    yili: "伊犁",
    Foshan: "佛山市",
    jiamusi: "佳木斯市",
    Baodingshi: "保定市",
    baoshan: "保山市",
    xinyang: "信阳市",
    kezilesu: "克孜勒苏",
    kelamayi: "克拉玛依市",
    liuan: "六安市",
    liupanshui: "六盘水市",
    lanzhou: "兰州市",
    xinganmeng: "兴安盟",
    neijiang: "内江市",
    liangshan: "凉山",
    baotou: "包头市",
    Beijing: "北京市",
    beihai: "北海市",
    shiyan: "十堰市",
    Nanjing: "南京市",
    nachong: "南充市",
    naning: "南宁市",
    naping: "南平市",
    nachang: "南昌市",
    natong: "南通市",
    nayang: "南阳市",
    boertala: "博尔塔拉",
    xiamen: "厦门市",
    shuangyashan: "双鸭山市",
    taizhou: "台州市",
    hefei: "合肥市",
    jian: "吉安市",
    jilin: "吉林市",
    tulufan: "吐鲁番",
    luliang: "吕梁市",
    wuzhong: "吴忠市",
    zhoukou: "周口市",
    hulunbeie: "呼伦贝尔",
    huhehaote: "呼和浩特",
    hetian: "和田地区",
    xianyang: "咸阳市",
    hami: "哈密地区",
    haebin: "哈尔滨市",
    Tangshanshi: "唐山市",
    shangqiu: "商丘市",
    shangluo: "商洛市",
    kashi: "喀什地区",
    jiaxing: "嘉兴市",
    jiayuguan: "嘉峪关市",
    siping: "四平市",
    guyuan: "固原市",
    tacheng: "塔城地区",
    daxinganling: "大兴安岭",
    datong: "大同市",
    daqing: "大庆市",
    dali: "大理",
    dalian: "大连市",
    tianshui: "天水市",
    Tianjin: "天津市",
    taiyuan: "太原市",
    weihai: "威海市",
    loudi: "娄底市",
    xiaogan: "孝感市",
    ningde: "宁德市",
    Ningbo: "宁波市",
    anqing: "安庆市",
    ankang: "安康市",
    anyang: "安阳市",
    anshun: "安顺市",
    dingxi: "定西市",
    yibin: "宜宾市",
    yichang: "宜昌市",
    yichun: "宜春市",
    baoji: "宝鸡市",
    xuancheng: "宣城市",
    suzhou: "宿州市",
    suqian: "宿迁市",
    shanna: "山南地区",
    yueyang: "岳阳市",
    chongzuo: "崇左市",
    bazhong: "巴中市",
    bayannaoe: "巴彦淖尔",
    bayinguoleng: "巴音郭楞",
    changzhou: "常州市",
    changde: "常德市",
    pingliang: "平凉市",
    pingdingshan: "平顶山市",
    guangyuan: "广元市",
    guangan: "广安市",
    Guangzhou: "广州市",
    qingyang: "庆阳市",
    Langfangshi: "廊坊市",
    yanan: "延安市",
    yanbian: "延边",
    kaifeng: "开封市",
    Zhangjiakou: "张家口市",
    zhangjiajie: "张家界市",
    zhangye: "张掖市",
    xuzhou: "徐州市",
    dehong: "德宏",
    dezhou: "德州市",
    deyang: "德阳市",
    xinzhou: "忻州市",
    huaihua: "怀化市",
    eshi: "恩施",
    Huizhou: "惠州市",
    Chengdu: "成都市",
    yangzhou: "扬州市",
    Chengdeishi: "承德市",
    fuzhou: "抚州市",
    fushun: "抚顺市",
    lasa: "拉萨市",
    Jieyang: "揭阳市",
    panzhihua: "攀枝花市",
    wenshan: "文山",
    xinxiang: "新乡市",
    xinyu: "新余市",
    Wuxi: "无锡市",
    rikaze: "日喀则",
    rizhao: "日照市",
    kunming: "昆明市",
    changji: "昌吉",
    changdu: "昌都地区",
    zhaotong: "昭通市",
    jinzhong: "晋中市",
    jincheng: "晋城市",
    puer: "普洱市",
    jingdezhen: "景德镇市",
    qujing: "曲靖市",
    shuozhou: "朔州市",
    chaoyang: "朝阳市",
    benxi: "本溪市",
    laibin: "来宾市",
    hangzhou: "杭州市",
    songyuan: "松原市",
    linzhi: "林芝地区",
    guoluo: "果洛",
    zaozhuang: "枣庄市",
    liuzhou: "柳州市",
    zhuzhou: "株洲市",
    Meizhou: "梅州市",
    wuzhou: "梧州市",
    chuxiong: "楚雄",
    yulin: "榆林市",
    wuwei: "武威市",
    Wuhan: "武汉市",
    bijie: "毕节市",
    yongzhou: "永州市",
    hanzhong: "汉中市",
    Shantou: "汕头市",
    Shanwei: "汕尾市",
    Jiangmen: "江门市",
    chizhou: "池州市",
    shenyang: "沈阳市",
    Changzhoushi: "沧州市",
    hechi: "河池市",
    Heyuan: "河源市",
    quanzhou: "泉州市",
    taian: "泰安市",
    taizhou: "泰州市",
    luzhou: "泸州市",
    luoyang: "洛阳市",
    jina: "济南市",
    jining: "济宁市",
    haidong: "海东",
    haibei: "海北",
    haina: "海南",
    haikou: "海口市",
    haixi: "海西",
    zibo: "淄博市",
    huaibei: "淮北市",
    huaina: "淮南市",
    huaian: "淮安市",
    Shenzhen: "深圳市",
    Qingyuan: "清远市",
    wenzhou: "温州市",
    weina: "渭南市",
    xiangtan: "湘潭市",
    xiangxi: "湘西",
    Zhanjiang: "湛江市",
    chuzhou: "滁州市",
    binzhou: "滨州市",
    luohe: "漯河市",
    zhangzhou: "漳州市",
    weifang: "潍坊市",
    qianjiang: "潜江市",
    Chaozhou: "潮州市",
    Macau: "澳门",
    puyang: "濮阳市",
    yantai: "烟台市",
    jiaozuo: "焦作市",
    mudanjiang: "牡丹江市",
    yulin: "玉林市",
    yushu: "玉树",
    yuxi: "玉溪市",
    Zhuhai: "珠海市",
    ganna: "甘南",
    ganzi: "甘孜",
    baicheng: "白城市",
    baishan: "白山市",
    baiyin: "白银市",
    baise: "百色市",
    yiyang: "益阳市",
    yancheng: "盐城市",
    panjin: "盘锦市",
    meishan: "眉山市",
    shizuishan: "石嘴山市",
    Shijiazhuang: "石家庄市",
    fuzhou: "福州市",
    Qinhuangdao: "秦皇岛市",
    honghe: "红河",
    shaoxing: "绍兴市",
    suihua: "绥化市",
    mianyang: "绵阳市",
    liaocheng: "聊城市",
    Zhaoqing: "肇庆市",
    zigong: "自贡市",
    zhoushan: "舟山市",
    wuhu: "芜湖市",
    Suzhou: "苏州市",
    Maoming: "茂名市",
    jingzhou: "荆州市",
    jingmen: "荆门市",
    putian: "莆田市",
    laiwu: "莱芜市",
    heze: "菏泽市",
    pingxiang: "萍乡市",
    yingkou: "营口市",
    huludao: "葫芦岛市",
    bangbu: "蚌埠市",
    Hengshuishi: "衡水市",
    hengyang: "衡阳市",
    quzhou: "衢州市",
    xishuangbanna: "西双版纳",
    xining: "西宁市",
    xian: "西安市",
    xuchang: "许昌市",
    guigang: "贵港市",
    guiyang: "贵阳市",
    hezhou: "贺州市",
    ziyang: "资阳市",
    ganzhou: "赣州市",
    chifeng: "赤峰市",
    liaoyuan: "辽源市",
    liaoyang: "辽阳市",
    dazhou: "达州市",
    yuncheng: "运城市",
    lianyungang: "连云港市",
    tonghua: "通化市",
    tongliao: "通辽市",
    suining: "遂宁市",
    zunyi: "遵义市",
    Xingtaishi: "邢台市",
    naqu: "那曲地区",
    Handanshi: "邯郸市",
    zhengzhou: "郑州市",
    chenzhou: "郴州市",
    eeduosi: "鄂尔多斯市",
    ezhou: "鄂州市",
    jiuquan: "酒泉市",
    Chongqing: "重庆市",
    jinhua: "金华市",
    jinchang: "金昌市",
    qinzhou: "钦州市",
    tieling: "铁岭市",
    tongren: "铜仁市",
    tongchuan: "铜川市",
    tongling: "铜陵市",
    yinchuan: "银川市",
    xilinguole: "锡林郭勒",
    jinzhou: "锦州市",
    zhenjiang: "镇江市",
    changchun: "长春市",
    changsha: "长沙市",
    changzhi: "长治市",
    fuxin: "阜新市",
    fuyang: "阜阳市",
    fangchenggang: "防城港市",
    Yangjiang: "阳江市",
    yangquan: "阳泉市",
    akesu: "阿克苏",
    aletai: "阿勒泰",
    aba: "阿坝",
    alashanmeng: "阿拉善盟",
    ali: "阿里地区",
    longna: "陇南市",
    suizhou: "随州市",
    yaan: "雅安市",
    qingdao: "青岛市",
    anshan: "鞍山市",
    Shaoguan: "韶关市",
    Hongkong: "香港",
    maanshan: "马鞍山市",
    zhumadian: "驻马店市",
    jixi: "鸡西市",
    hebi: "鹤壁市",
    hegang: "鹤岗市",
    yingtan: "鹰潭市",
    huanggang: "黄冈市",
    huangna: "黄南",
    huangshan: "黄山市",
    huangshi: "黄石市",
    heihe: "黑河市",
    qianxina: "黔西南",
    qiqihae: "齐齐哈尔",
    longyan: "龙岩市",
    xianning: "咸宁市",
    nujiang: "怒江",
    guilin: "桂林市",
    huzhou: "湖州市",
    diqing: "迪庆",
    shaoyang: "邵阳市",
    qiandongna: "黔东南",
    qianna: "黔南"
};
UAir.CityLoc = {
    "京津冀": {
        Lat: 38.685,
        Lng: 116.45
    },
    "长三角": {
        Lat: 30.92,
        Lng: 120.1
    },
    "珠三角": {
        Lat: 23.089,
        Lng: 113.8
    },
    "成渝": {
        Lat: 30.156,
        Lng: 105.1
    },
    "福建省": {
        Lng: 117.830794,
        Lat: 25.268361
    },
    "北京": {
        Lat: 39.904667,
        Lng: 116.408198
    },
    "上海": {
        Lat: 31.230225,
        Lng: 121.473695
    },
    "天津": {
        Lat: 39.444326,
        Lng: 117.300456
    },
    "重庆": {
        Lat: 29.561701,
        Lng: 106.534358
    },
    "七台河市": {
        Lng: 131.004852,
        Lat: 45.766595
    },
    "三亚市": {
        Lng: 109.51212,
        Lat: 18.253712
    },
    "三明市": {
        Lng: 117.630794,
        Lat: 26.268361
    },
    "三门峡市": {
        Lng: 111.168637,
        Lat: 34.778571
    },
    "上海市": {
        Lng: 121.476814,
        Lat: 31.245355
    },
    "上饶市": {
        Lng: 117.944035,
        Lat: 28.454663
    },
    "东莞市": {
        Lng: 113.751804,
        Lat: 23.039401
    },
    "东营市": {
        Lng: 118.571902,
        Lat: 37.480255
    },
    "中卫市": {
        Lng: 105.186399,
        Lat: 37.51479
    },
    "中山市": {
        Lng: 113.410131,
        Lat: 22.541626
    },
    "临夏": {
        Lng: 103.206596,
        Lat: 35.592628
    },
    "临汾市": {
        Lng: 111.526011,
        Lat: 36.094226
    },
    "临沂市": {
        Lng: 118.328616,
        Lat: 35.066645
    },
    "临沧市": {
        Lng: 100.084926,
        Lat: 23.884093
    },
    "丹东市": {
        Lng: 124.326371,
        Lat: 40.121249
    },
    "丽水市": {
        Lng: 119.918594,
        Lat: 28.453947
    },
    "丽江市": {
        Lng: 100.222022,
        Lat: 26.872746
    },
    "乌兰察布": {
        Lng: 113.098954,
        Lat: 41.014874
    },
    "乌海市": {
        Lng: 106.82081,
        Lat: 39.676185
    },
    "乌鲁木齐": {
        Lng: 87.555453,
        Lat: 43.833325
    },
    "乐山市": {
        Lng: 103.752051,
        Lat: 29.597942
    },
    "九江市": {
        Lng: 115.988235,
        Lat: 29.716454
    },
    "云浮市": {
        Lng: 112.039097,
        Lat: 22.934706
    },
    "亳州市": {
        Lng: 115.775938,
        Lat: 33.866386
    },
    "伊春市": {
        Lng: 128.89728,
        Lat: 47.726421
    },
    "伊犁": {
        Lng: 81.288288,
        Lat: 43.915276
    },
    "佛山市": {
        Lng: 113.122022,
        Lat: 23.031712
    },
    "佳木斯市": {
        Lng: 130.270447,
        Lat: 46.805856
    },
    "保定市": {
        Lng: 115.481951,
        Lat: 38.879957
    },
    "保山市": {
        Lng: 99.170498,
        Lat: 25.117614
    },
    "信阳市": {
        Lng: 114.073098,
        Lat: 32.124601
    },
    "克孜勒苏": {
        Lng: 76.12779,
        Lat: 39.744068
    },
    "克拉玛依市": {
        Lng: 84.872248,
        Lat: 45.587544
    },
    "六安市": {
        Lng: 116.493681,
        Lat: 31.751317
    },
    "六盘水市": {
        Lng: 104.84303,
        Lat: 26.589618
    },
    "兰州市": {
        Lng: 103.814423,
        Lat: 36.058253
    },
    "兴安盟": {
        Lng: 122.035668,
        Lat: 46.075425
    },
    "内江市": {
        Lng: 105.063245,
        Lat: 29.596338
    },
    "凉山": {
        Lng: 102.251651,
        Lat: 27.88957
    },
    "包头市": {
        Lng: 109.833958,
        Lat: 40.640223
    },
    "北京市": {
        Lng: 116.391248,
        Lat: 39.90714
    },
    "北海市": {
        Lng: 109.111826,
        Lat: 21.469165
    },
    "十堰市": {
        Lng: 110.789371,
        Lat: 32.633253
    },
    "南京市": {
        Lng: 118.766361,
        Lat: 32.053174
    },
    "南充市": {
        Lng: 106.095074,
        Lat: 30.797165
    },
    "南宁市": {
        Lng: 108.286719,
        Lat: 22.803614
    },
    "南平市": {
        Lng: 118.170396,
        Lat: 26.64081
    },
    "南昌市": {
        Lng: 115.882133,
        Lat: 28.687015
    },
    "南通市": {
        Lng: 120.86309,
        Lat: 32.0107
    },
    "南阳市": {
        Lng: 112.530519,
        Lat: 33.0073
    },
    "博尔塔拉": {
        Lng: 82.04265,
        Lat: 44.906752
    },
    "厦门市": {
        Lng: 118.092448,
        Lat: 24.48562
    },
    "双鸭山市": {
        Lng: 131.156935,
        Lat: 46.646517
    },
    "台州市": {
        Lng: 121.429784,
        Lat: 28.664882
    },
    "合肥市": {
        Lng: 117.270672,
        Lat: 31.863048
    },
    "吉安市": {
        Lng: 114.980628,
        Lat: 27.111146
    },
    "吉林市": {
        Lng: 126.552259,
        Lat: 43.864
    },
    "吐鲁番": {
        Lng: 89.256865,
        Lat: 42.671343
    },
    "吕梁市": {
        Lng: 111.130367,
        Lat: 37.520299
    },
    "吴忠市": {
        Lng: 106.197465,
        Lat: 37.9867
    },
    "周口市": {
        Lng: 114.642152,
        Lat: 33.61964
    },
    "呼伦贝尔": {
        Lng: 119.747109,
        Lat: 49.193332
    },
    "呼和浩特": {
        Lng: 111.646981,
        Lat: 40.821344
    },
    "和田地区": {
        Lng: 79.346206,
        Lat: 35.677998
    },
    "咸阳市": {
        Lng: 108.696402,
        Lat: 34.34058
    },
    "哈密地区": {
        Lng: 93.521251,
        Lat: 42.3372
    },
    "哈尔滨市": {
        Lng: 126.645072,
        Lat: 45.765622
    },
    "唐山市": {
        Lng: 118.170659,
        Lat: 39.643075
    },
    "商丘市": {
        Lng: 115.629842,
        Lat: 34.434214
    },
    "商洛市": {
        Lng: 109.922824,
        Lat: 33.869278
    },
    "喀什地区": {
        Lng: 76.004757,
        Lat: 39.506973
    },
    "嘉兴市": {
        Lng: 120.749568,
        Lat: 30.770351
    },
    "嘉峪关市": {
        Lng: 98.274672,
        Lat: 39.795322
    },
    "四平市": {
        Lng: 124.378515,
        Lat: 43.16726
    },
    "固原市": {
        Lng: 106.274497,
        Lat: 36.015777
    },
    "塔城地区": {
        Lng: 83.180222,
        Lat: 46.804402
    },
    "大兴安岭": {
        Lng: 124.181972,
        Lat: 51.983873
    },
    "大同市": {
        Lng: 113.277116,
        Lat: 40.10624
    },
    "大庆市": {
        Lng: 125.008576,
        Lat: 46.588618
    },
    "大理": {
        Lng: 100.216095,
        Lat: 25.593646
    },
    "大连市": {
        Lng: 121.582049,
        Lat: 38.941815
    },
    "天水市": {
        Lng: 105.726544,
        Lat: 34.579385
    },
    "天津市": {
        Lng: 117.197969,
        Lat: 39.136952
    },
    "太原市": {
        Lng: 112.538136,
        Lat: 37.883478
    },
    "威海市": {
        Lng: 122.082314,
        Lat: 37.522009
    },
    "娄底市": {
        Lng: 111.984346,
        Lat: 27.73849
    },
    "孝感市": {
        Lng: 113.923669,
        Lat: 30.924749
    },
    "宁德市": {
        Lng: 119.530982,
        Lat: 26.653711
    },
    "宁波市": {
        Lng: 121.568442,
        Lat: 29.881596
    },
    "安庆市": {
        Lng: 117.046721,
        Lat: 30.53454
    },
    "安康市": {
        Lng: 109.026598,
        Lat: 32.700657
    },
    "安阳市": {
        Lng: 114.339362,
        Lat: 36.103903
    },
    "安顺市": {
        Lng: 105.918429,
        Lat: 26.226255
    },
    "定西市": {
        Lng: 104.617541,
        Lat: 35.580406
    },
    "宜宾市": {
        Lng: 104.624256,
        Lat: 28.76693
    },
    "宜昌市": {
        Lng: 111.298685,
        Lat: 30.729469
    },
    "宜春市": {
        Lng: 114.388212,
        Lat: 27.808323
    },
    "宝鸡市": {
        Lng: 107.159442,
        Lat: 34.35907
    },
    "宣城市": {
        Lng: 118.74039,
        Lat: 30.948197
    },
    "宿州市": {
        Lng: 116.9768,
        Lat: 33.632031
    },
    "宿迁市": {
        Lng: 118.284908,
        Lat: 33.947278
    },
    "山南地区": {
        Lng: 91.742822,
        Lat: 29.226378
    },
    "岳阳市": {
        Lng: 113.133823,
        Lat: 29.37431
    },
    "崇左市": {
        Lng: 107.346658,
        Lat: 22.412468
    },
    "巴中市": {
        Lng: 106.747201,
        Lat: 31.865603
    },
    "巴彦淖尔": {
        Lng: 107.411793,
        Lat: 40.761496
    },
    "巴音郭楞": {
        Lng: 86.112366,
        Lat: 41.764015
    },
    "常州市": {
        Lng: 119.970661,
        Lat: 31.767352
    },
    "常德市": {
        Lng: 111.641688,
        Lat: 29.009538
    },
    "平凉市": {
        Lng: 106.678226,
        Lat: 35.544225
    },
    "平顶山市": {
        Lng: 113.288144,
        Lat: 33.74053
    },
    "广元市": {
        Lng: 105.809415,
        Lat: 32.437304
    },
    "广安市": {
        Lng: 106.625379,
        Lat: 30.461002
    },
    "广州市": {
        Lng: 113.295803,
        Lat: 23.116604
    },
    "庆阳市": {
        Lng: 107.63312,
        Lat: 35.7209
    },
    "廊坊市": {
        Lng: 116.691032,
        Lat: 39.511836
    },
    "延安市": {
        Lng: 109.488504,
        Lat: 36.597537
    },
    "延边": {
        Lng: 129.472476,
        Lat: 42.887498
    },
    "开封市": {
        Lng: 114.339327,
        Lat: 34.796436
    },
    "张家口市": {
        Lng: 114.881065,
        Lat: 40.804126
    },
    "张家界市": {
        Lng: 110.470101,
        Lat: 29.121958
    },
    "张掖市": {
        Lng: 100.451771,
        Lat: 38.932423
    },
    "徐州市": {
        Lng: 117.175729,
        Lat: 34.267094
    },
    "德宏": {
        Lng: 98.582716,
        Lat: 24.438702
    },
    "德州市": {
        Lng: 116.31574,
        Lat: 37.454271
    },
    "德阳市": {
        Lng: 104.393294,
        Lat: 31.126982
    },
    "忻州市": {
        Lng: 112.714783,
        Lat: 38.454707
    },
    "怀化市": {
        Lng: 109.97577,
        Lat: 27.555173
    },
    "恩施": {
        Lng: 109.480446,
        Lat: 30.282653
    },
    "惠州市": {
        Lng: 114.399132,
        Lat: 23.110272
    },
    "成都市": {
        Lng: 104.058972,
        Lat: 30.676242
    },
    "扬州市": {
        Lng: 119.415813,
        Lat: 32.404295
    },
    "承德市": {
        Lng: 117.921037,
        Lat: 40.985053
    },
    "抚州市": {
        Lng: 116.349376,
        Lat: 27.951936
    },
    "抚顺市": {
        Lng: 123.917589,
        Lat: 41.869286
    },
    "拉萨市": {
        Lng: 91.103841,
        Lat: 29.659126
    },
    "揭阳市": {
        Lng: 116.368288,
        Lat: 23.544304
    },
    "攀枝花市": {
        Lng: 101.714295,
        Lat: 26.585397
    },
    "文山": {
        Lng: 104.237693,
        Lat: 23.370886
    },
    "新乡市": {
        Lng: 113.900282,
        Lat: 35.301776
    },
    "新余市": {
        Lng: 114.935808,
        Lat: 27.819508
    },
    "无锡市": {
        Lng: 120.294251,
        Lat: 31.566279
    },
    "日喀则": {
        Lng: 88.947471,
        Lat: 29.265408
    },
    "日照市": {
        Lng: 119.495207,
        Lat: 35.414171
    },
    "昆明市": {
        Lng: 102.706741,
        Lat: 25.045967
    },
    "昌吉": {
        Lng: 87.286363,
        Lat: 44.000009
    },
    "昌都地区": {
        Lng: 97.23708,
        Lat: 31.444776
    },
    "昭通市": {
        Lng: 103.716389,
        Lat: 27.338237
    },
    "晋中市": {
        Lng: 112.725422,
        Lat: 37.687014
    },
    "晋城市": {
        Lng: 112.85465,
        Lat: 35.494583
    },
    "普洱市": {
        Lng: 100.972316,
        Lat: 22.78604
    },
    "景德镇市": {
        Lng: 117.174602,
        Lat: 29.300516
    },
    "曲靖市": {
        Lng: 103.774006,
        Lat: 25.517703
    },
    "朔州市": {
        Lng: 112.466651,
        Lat: 39.330704
    },
    "朝阳市": {
        Lng: 120.433904,
        Lat: 41.563594
    },
    "本溪市": {
        Lng: 123.765534,
        Lat: 41.318084
    },
    "来宾市": {
        Lng: 109.221049,
        Lat: 23.737702
    },
    "杭州市": {
        Lng: 120.208338,
        Lat: 30.255575
    },
    "松原市": {
        Lng: 124.820207,
        Lat: 45.127989
    },
    "林芝地区": {
        Lng: 94.372637,
        Lat: 29.780154
    },
    "果洛": {
        Lng: 100.215912,
        Lat: 34.47567
    },
    "枣庄市": {
        Lng: 117.266976,
        Lat: 34.802867
    },
    "柳州市": {
        Lng: 109.411325,
        Lat: 24.32566
    },
    "株洲市": {
        Lng: 113.119341,
        Lat: 27.824629
    },
    "梅州市": {
        Lng: 116.115046,
        Lat: 24.301286
    },
    "梧州市": {
        Lng: 111.293766,
        Lat: 23.482277
    },
    "楚雄": {
        Lng: 101.52147,
        Lat: 25.063062
    },
    "榆林市": {
        Lng: 109.733733,
        Lat: 38.273229
    },
    "武威市": {
        Lng: 102.631932,
        Lat: 37.926916
    },
    "武汉市": {
        Lng: 114.304199,
        Lat: 30.577725
    },
    "毕节市": {
        Lng: 105.323453,
        Lat: 27.405959
    },
    "永州市": {
        Lng: 111.602962,
        Lat: 26.433237
    },
    "汉中市": {
        Lng: 107.034497,
        Lat: 33.077089
    },
    "汕头市": {
        Lng: 116.717598,
        Lat: 23.380596
    },
    "汕尾市": {
        Lng: 115.36147,
        Lat: 22.775628
    },
    "江门市": {
        Lng: 113.066152,
        Lat: 22.571905
    },
    "池州市": {
        Lng: 117.482553,
        Lat: 30.656003
    },
    "沈阳市": {
        Lng: 123.420005,
        Lat: 41.800545
    },
    "沧州市": {
        Lng: 116.851556,
        Lat: 38.290961
    },
    "河池市": {
        Lng: 108.059159,
        Lat: 24.696616
    },
    "河源市": {
        Lng: 114.702568,
        Lat: 23.753661
    },
    "泉州市": {
        Lng: 118.58939,
        Lat: 24.898729
    },
    "泰安市": {
        Lng: 117.076832,
        Lat: 36.181904
    },
    "泰州市": {
        Lng: 119.908353,
        Lat: 32.472367
    },
    "泸州市": {
        Lng: 105.433814,
        Lat: 28.893166
    },
    "洛阳市": {
        Lng: 112.434851,
        Lat: 34.652021
    },
    "济南市": {
        Lng: 117.01266,
        Lat: 36.676251
    },
    "济宁市": {
        Lng: 116.588941,
        Lat: 35.396832
    },
    "海东": {
        Lng: 102.076568,
        Lat: 36.511659
    },
    "海北": {
        Lng: 100.871755,
        Lat: 36.954929
    },
    "海南": {
        Lng: 100.616181,
        Lat: 36.279036
    },
    "海口市": {
        Lng: 110.319929,
        Lat: 20.018352
    },
    "海西": {
        Lng: 97.335488,
        Lat: 37.367133
    },
    "淄博市": {
        Lng: 118.046605,
        Lat: 36.798073
    },
    "淮北市": {
        Lng: 116.77955,
        Lat: 33.955336
    },
    "淮南市": {
        Lng: 117.006733,
        Lat: 32.638578
    },
    "淮安市": {
        Lng: 119.018271,
        Lat: 33.601627
    },
    "深圳市": {
        Lng: 114.014454,
        Lat: 22.542769
    },
    "清远市": {
        Lng: 113.028923,
        Lat: 23.694656
    },
    "温州市": {
        Lng: 120.680064,
        Lat: 28.000256
    },
    "渭南市": {
        Lng: 109.472128,
        Lat: 34.497652
    },
    "湘潭市": {
        Lng: 112.92371,
        Lat: 27.832327
    },
    "湘西": {
        Lng: 109.734429,
        Lat: 28.315653
    },
    "湛江市": {
        Lng: 110.354032,
        Lat: 21.253928
    },
    "滁州市": {
        Lng: 118.312751,
        Lat: 32.313015
    },
    "滨州市": {
        Lng: 117.956033,
        Lat: 37.398347
    },
    "漯河市": {
        Lng: 114.033517,
        Lat: 33.571956
    },
    "漳州市": {
        Lng: 117.664801,
        Lat: 24.514244
    },
    "潍坊市": {
        Lng: 119.130227,
        Lat: 36.709506
    },
    "潜江市": {
        Lng: 112.756517,
        Lat: 30.339741
    },
    "潮州市": {
        Lng: 116.619243,
        Lat: 23.658312
    },
    "澳门": {
        Lng: 113.545912,
        Lat: 22.201155
    },
    "濮阳市": {
        Lng: 115.014181,
        Lat: 35.747664
    },
    "烟台市": {
        Lng: 121.298059,
        Lat: 37.529414
    },
    "焦作市": {
        Lng: 113.19884,
        Lat: 35.229324
    },
    "牡丹江市": {
        Lng: 129.594617,
        Lat: 44.580215
    },
    "玉林市": {
        Lng: 110.14069,
        Lat: 22.640474
    },
    "玉树": {
        Lng: 97.006346,
        Lat: 33.002537
    },
    "玉溪市": {
        Lng: 102.537215,
        Lat: 24.367801
    },
    "珠海市": {
        Lng: 113.55083,
        Lat: 22.25397
    },
    "甘南": {
        Lng: 102.909138,
        Lat: 34.987591
    },
    "甘孜": {
        Lng: 101.961172,
        Lat: 30.052094
    },
    "白城市": {
        Lng: 122.828281,
        Lat: 45.613397
    },
    "白山市": {
        Lng: 126.423367,
        Lat: 41.93761
    },
    "白银市": {
        Lng: 104.162065,
        Lat: 36.540313
    },
    "百色市": {
        Lng: 106.621817,
        Lat: 23.898718
    },
    "益阳市": {
        Lng: 112.354239,
        Lat: 28.585449
    },
    "盐城市": {
        Lng: 120.137362,
        Lat: 33.375138
    },
    "盘锦市": {
        Lng: 122.061293,
        Lat: 41.133077
    },
    "眉山市": {
        Lng: 103.832776,
        Lat: 30.05793
    },
    "石嘴山市": {
        Lng: 106.368017,
        Lat: 39.013676
    },
    "石家庄市": {
        Lng: 114.509547,
        Lat: 38.042423
    },
    "福州市": {
        Lng: 119.318815,
        Lat: 26.044412
    },
    "秦皇岛市": {
        Lng: 119.592017,
        Lat: 39.938594
    },
    "红河": {
        Lng: 103.3755,
        Lat: 23.364517
    },
    "绍兴市": {
        Lng: 120.581945,
        Lat: 29.998752
    },
    "绥化市": {
        Lng: 126.97626,
        Lat: 46.638064
    },
    "绵阳市": {
        Lng: 104.696236,
        Lat: 31.501239
    },
    "聊城市": {
        Lng: 115.974615,
        Lat: 36.450092
    },
    "肇庆市": {
        Lng: 112.467868,
        Lat: 23.075364
    },
    "自贡市": {
        Lng: 104.766954,
        Lat: 29.355747
    },
    "舟山市": {
        Lng: 122.159167,
        Lat: 30.031961
    },
    "芜湖市": {
        Lng: 118.372099,
        Lat: 31.362202
    },
    "苏州市": {
        Lng: 120.609301,
        Lat: 31.313891
    },
    "茂名市": {
        Lng: 110.9202,
        Lat: 21.665234
    },
    "荆州市": {
        Lng: 112.229635,
        Lat: 30.329241
    },
    "荆门市": {
        Lng: 112.205095,
        Lat: 31.038609
    },
    "莆田市": {
        Lng: 119.066301,
        Lat: 25.445169
    },
    "莱芜市": {
        Lng: 117.672238,
        Lat: 36.227905
    },
    "菏泽市": {
        Lng: 115.450999,
        Lat: 35.25651
    },
    "萍乡市": {
        Lng: 113.848103,
        Lat: 27.636844
    },
    "营口市": {
        Lng: 122.221593,
        Lat: 40.66143
    },
    "葫芦岛市": {
        Lng: 120.849182,
        Lat: 40.735327
    },
    "蚌埠市": {
        Lng: 117.344878,
        Lat: 32.92489
    },
    "衡水市": {
        Lng: 115.673922,
        Lat: 37.739932
    },
    "衡阳市": {
        Lng: 112.572118,
        Lat: 26.8955
    },
    "衢州市": {
        Lng: 118.864478,
        Lat: 28.954262
    },
    "西双版纳": {
        Lng: 100.795449,
        Lat: 22.006004
    },
    "西宁市": {
        Lng: 101.759553,
        Lat: 36.634484
    },
    "西安市": {
        Lng: 108.942029,
        Lat: 34.273155
    },
    "许昌市": {
        Lng: 113.82281,
        Lat: 34.022484
    },
    "贵港市": {
        Lng: 109.602963,
        Lat: 23.100494
    },
    "贵阳市": {
        Lng: 106.698966,
        Lat: 26.627348
    },
    "贺州市": {
        Lng: 111.540844,
        Lat: 24.408354
    },
    "资阳市": {
        Lng: 104.627092,
        Lat: 30.128737
    },
    "赣州市": {
        Lng: 114.92469,
        Lat: 25.842403
    },
    "赤峰市": {
        Lng: 118.918184,
        Lat: 42.288828
    },
    "辽源市": {
        Lng: 125.120735,
        Lat: 42.914813
    },
    "辽阳市": {
        Lng: 123.16004,
        Lat: 41.265436
    },
    "达州市": {
        Lng: 107.483814,
        Lat: 31.210458
    },
    "运城市": {
        Lng: 110.994678,
        Lat: 35.033293
    },
    "连云港市": {
        Lng: 119.161793,
        Lat: 34.596135
    },
    "通化市": {
        Lng: 125.930396,
        Lat: 41.728614
    },
    "通辽市": {
        Lng: 122.248351,
        Lat: 43.625272
    },
    "遂宁市": {
        Lng: 105.554887,
        Lat: 30.554466
    },
    "遵义市": {
        Lng: 106.921047,
        Lat: 27.69718
    },
    "邢台市": {
        Lng: 114.508081,
        Lat: 37.063179
    },
    "那曲地区": {
        Lng: 92.026961,
        Lat: 31.248535
    },
    "邯郸市": {
        Lng: 114.470304,
        Lat: 36.602706
    },
    "郑州市": {
        Lng: 113.637183,
        Lat: 34.751442
    },
    "郴州市": {
        Lng: 113.025732,
        Lat: 25.778852
    },
    "鄂尔多斯市": {
        Lng: 109.981421,
        Lat: 39.809797
    },
    "鄂州市": {
        Lng: 114.883944,
        Lat: 30.381458
    },
    "酒泉市": {
        Lng: 98.501348,
        Lat: 39.734502
    },
    "重庆市": {
        Lng: 106.520297,
        Lat: 29.541476
    },
    "金华市": {
        Lng: 119.641455,
        Lat: 29.099515
    },
    "金昌市": {
        Lng: 102.199623,
        Lat: 38.509778
    },
    "钦州市": {
        Lng: 108.628564,
        Lat: 21.970323
    },
    "铁岭市": {
        Lng: 123.842594,
        Lat: 42.291274
    },
    "铜仁市": {
        Lng: 109.157417,
        Lat: 27.6722
    },
    "铜川市": {
        Lng: 108.956915,
        Lat: 34.903099
    },
    "铜陵市": {
        Lng: 117.807623,
        Lat: 30.937124
    },
    "银川市": {
        Lng: 106.195667,
        Lat: 38.495815
    },
    "锡林郭勒": {
        Lng: 116.01417,
        Lat: 43.93131
    },
    "锦州市": {
        Lng: 121.135517,
        Lat: 41.123173
    },
    "镇江市": {
        Lng: 119.443825,
        Lat: 32.200664
    },
    "长春市": {
        Lng: 125.300722,
        Lat: 43.8899
    },
    "长沙市": {
        Lng: 112.967224,
        Lat: 28.211238
    },
    "长治市": {
        Lng: 113.107059,
        Lat: 36.195709
    },
    "阜新市": {
        Lng: 121.648976,
        Lat: 42.011064
    },
    "阜阳市": {
        Lng: 115.809097,
        Lat: 32.896944
    },
    "防城港市": {
        Lng: 108.341348,
        Lat: 21.613659
    },
    "阳江市": {
        Lng: 111.96549,
        Lat: 21.86804
    },
    "阳泉市": {
        Lng: 113.556205,
        Lat: 37.863254
    },
    "阿克苏": {
        Lng: 81.146644,
        Lat: 40.342864
    },
    "阿勒泰": {
        Lng: 87.916666,
        Lat: 47.883264
    },
    "阿坝": {
        Lng: 102.220475,
        Lat: 31.901827
    },
    "阿拉善盟": {
        Lng: 105.685031,
        Lat: 38.836502
    },
    "阿里地区": {
        Lng: 81.09864,
        Lat: 30.401187
    },
    "陇南市": {
        Lng: 104.925109,
        Lat: 33.390625
    },
    "随州市": {
        Lng: 113.366659,
        Lat: 31.713627
    },
    "雅安市": {
        Lng: 103.000989,
        Lat: 29.99659
    },
    "青岛市": {
        Lng: 120.372887,
        Lat: 36.098689
    },
    "鞍山市": {
        Lng: 122.995859,
        Lat: 41.110449
    },
    "韶关市": {
        Lng: 113.582696,
        Lat: 24.80034
    },
    "香港": {
        Lng: 114.174637,
        Lat: 22.290676
    },
    "马鞍山市": {
        Lng: 118.504133,
        Lat: 31.684771
    },
    "驻马店市": {
        Lng: 114.036671,
        Lat: 32.979197
    },
    "鸡西市": {
        Lng: 130.928028,
        Lat: 45.313209
    },
    "鹤壁市": {
        Lng: 114.285248,
        Lat: 35.749836
    },
    "鹤岗市": {
        Lng: 130.278126,
        Lat: 47.330288
    },
    "鹰潭市": {
        Lng: 117.023743,
        Lat: 28.238608
    },
    "黄冈市": {
        Lng: 114.894999,
        Lat: 30.443124
    },
    "黄南": {
        Lng: 101.999376,
        Lat: 35.517011
    },
    "黄山市": {
        Lng: 118.281944,
        Lat: 29.731015
    },
    "黄石市": {
        Lng: 115.03878,
        Lat: 30.212625
    },
    "黑河市": {
        Lng: 127.486742,
        Lat: 50.243332
    },
    "黔西南": {
        Lng: 104.891647,
        Lat: 25.091993
    },
    "齐齐哈尔": {
        Lng: 123.974104,
        Lat: 47.339474
    },
    "龙岩市": {
        Lng: 117.006701,
        Lat: 25.075208
    },
    "咸宁市": {
        Lat: 29.87750246,
        Lng: 114.2881057
    },
    "怒江": {
        Lat: 25.85799612,
        Lng: 98.85302556
    },
    "桂林市": {
        Lat: 25.25967979,
        Lng: 110.2498842
    },
    "湖州市": {
        Lat: 30.87372643,
        Lng: 120.1259742
    },
    "迪庆": {
        Lat: 27.82836282,
        Lng: 99.70614657
    },
    "邵阳市": {
        Lat: 27.23391164,
        Lng: 111.4494445
    },
    "黔东南": {
        Lat: 26.58130974,
        Lng: 107.9747702
    },
    "黔南": {
        Lat: 26.26163353,
        Lng: 107.5125916
    }
};